# -*- coding: UTF-8 -*-

# 寻找水仙花数
# 说明：水仙花数也称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数、它是一个3位数，该数字每个位上的数字立方之和正好等于它本身
# 例如： $1^3 + 5^3 + 3^3 = 153$
print('=========寻找水仙花数===========')
for num in range(100, 1000):
    low = num // 100
    mid = num // 10 % 10
    high = num % 10
    if num == low ** 3 + mid ** 3 + high ** 3:
        print(num, low, mid, high)

# 百钱百鸡问题
# 说明：公鸡 5远一只，母鸡3元一只，小鸡1元三只，100元买鸡，问公鸡，母鸡，小鸡各多少只
print('=========百钱百鸡问题===========')
for x in range(0, 20):
    for y in range(0, 33):
        z = 100 - x - y
        if 5 * x + 3 * y + z / 3 == 100:
          print(x, y, z)